main_help = """🕹 بازی مافیا، نبرد استدلال و منطق دو گروه شهروند و مافیا است. در این بازی، اصولا سه مافیا وجود دارد و بازیکن‌ها باید با ظن زدن و صحبت کردن، مافیای بازی را بیرون کنند. بازیکن‌ها در دو فاز رای‌گیری و اجرای قابلیت‌ها در شب، از بازی خارج می‌شوند و اینکه مافیا برنده نهایی بازی باشد یا شهروندان، به عملکرد، استدلال آوری و هوش هر دو تیم بستگی دارد.
                \n♦ مرحله اول: روز معارفه\n➖ پس از پخش شدن نقش‌ها، روز معارفه آغاز می‌شود، در روز معارفه هر بازیکن نام خود را می‌گوید و با اعلام اولین مشکوک‌های ذهنی خود بر اساس فکت یا اکت، جریان بازی شکل می‌گیرد، در این مرحله، مافیا ممکن است به یار خود نیز تارگت بزند.
                \n♦ مرحله دوم: شب معارفه\n➖ پس از پایان روز معارفه، شب معارفه با اعلام راوی شروع می‌شود. در شب معارفه، مافیاها چشم باز می‌کنند و همدیگر را می‌شناسند و فرصت کوتاهی برای مشورت جهت چیدن سناریو خواهند داشت.
                \n♦ مرحله سوم: روز اول\n➖ در روز اول همچون روز معارفه، دوباره بازیکن‌ها شروع به صحبت می‌کنند و این بار استدلال و فکت بیشتری در بازی جریان پیدا می‌کند، بعد از صحبت آخرین نفر، نوبت به رای‌گیری می‌رسد و اگر کسی حداکثر رای روز را داشته باشد، از بازی خارج می‌شود.
                \n♦ مرحله چهارم: شب اول\n➖ پس از رای گیری، شب اول شروع می‌شود و قابلیت‌های هر یک از بازیکن‌ها در تیم شهروندان و مافیاها فعال می‌شوند و هیجان واقعی نیز از شب اول به بازی مافیا با چشمان بسته و شلیک‌های مافیا و عملکرد شهروندان، به بازی تزریق می‌شود.
                \n♻ پس از گذشت شب اول، روز دوم بازی آغاز می‌شود و همین روال تا جایی ادامه پیدا می‌کند که یا تعداد شهروندان و مافیاها مساوی شود که در این صورت، مافیا برنده بازی است یا تمامی مافیاها از بازی بیرون بروند که در این حالت، شهروندان تیم برنده خواهند بود.
                \n⚡ همچنین تقابل 2 شهروند و 1 مافیا در بازی مافیا، کی آس (Chaos) نام دارد و در این حالت، راوی دو دقیقه فرصت صحبت فری دیسکاشن یا آزاد به پلیرها می‌دهد و در این زمان کوتاه، شهروندان باید تک مافیای بازی را انتخاب کنند و مافیا نیز باید شهروندان را فریب دهد.
                در پایان زمان صحبت، هر سه بازیکن باید با چشمان بسته، شهروند خودشان را انتخاب کنند و اگر مافیا شهروند مشترک شود یا شهروند نهایی به مافیا دست بدهد، تیم مافیا برنده خواهد بود و در غیر این صورت، شهروندان بازی را برده‌‌اند."""

roles_help = """🎩 در نسخه فعلی بات، مافیا با نقش های کلاسیک بازی میشود که تمامی آن‌ها توضیح داده می‌شوند:
                \n◼پدر خوانده: سر دسته تیم مافیا است. شات هر شب از دست پدر خوانده گرفته‌ می‌شود و هیچ تصمیم مهمی در ساید مافیا بدون اجازه او گرفته نخواهد شد همچنین استعلام پدر خوانده برای کارآگاه، بار اول منفی است.
                ◼مافیا ساده: مافیایی است که هیچ قابلیت خاصی ندارد و تنها می‌تواند شب‌ها با تیم مافیا بیدار شود و برای شات شب، به دیگر اعضای  مشورت دهد تا تیم مافیا، شات شب بهتری داشته باشد.
                ◼دکتر لکتر: دکتر تیم مافیاها است. دکتر لکتر می‌تواند حدس بزند کدام مافیا شات شب بوده و او را نجات دهد.
                \n◻شهروند ساده: در فاز شب، قابلیت خاصی ندارند و تنها قدرت آن‌ها در بازی، استدلال آوری و رای روز است.
                ◻دکتر: اگر بتواند که به درستی حدس بزند ساید مافیا کدام بازیکن را شات کرده‌اند، هیچ بازیکنی از بازی در اثر شات شب مافیا بیرون نخواهد رفت.
                ◻کارآگاه: وظیفه استعلام گرفتن از تیم مافیا را بر عهده دارد، اگر کارآگاه بتواند درست مافیاها را تشخیص بدهد، راوی به او لایک می‌دهد و البته فراموش نکنید که استعلام پدرخوانده، بار اول منفی است.
                ◻تک تیر انداز: می‌تواند از شب یک ، به مافیای ذهنی خود در فاز شب، شلیک کند. شات تک تیر انداز، فایر بک دارد یعنی اگر شما به عنوان تک تیر انداز، یک شهروند را شات کنید، خودتان از بازی بیرون می‌روید."""

rules_help = """⚠ عدم رعایت قوانین، جذابیت بازی را از بین می‌برد و همچنین باعث ایجاد محدودیت استفاده از بات برای شما می‌شود.
                \n➖ افشای نقش ممنوع!\n➖ به هیچ عنوان قسم نخورید!
                ➖ بعد از کشته شدن با بازیکنان ارتباط نگیرید!
                ➖ فرندلی فایر ممنوع!\n➖ استفاده از الفاظ رکیک در گروه های خصوصی با رضایت اعضا، آزاد است.
                ➖ بحث‌ها و شوخی‌های سیاسی عقیدتی به دلایل واضح ممنوع!\n\n🚫 اسپم و دیداس باعث بن دائمی می‌شود!
                🚫 تمامی حقوق بات نزد توسعه‌دهنگان محفوظ است و نقض آن‌ها پیگرد قانونی خواهد داشت!"""